# قاعدة بيانات الأسئلة حسب نوع الطارئ
emergency_questions = {
    "CIVIL": [
        "هل هناك مصابون أو مفقودون",
        "هل الطرق مقطوعة",
        "هل تحتاجون إلى إنقاذ فوري",
        "موقع المشكلة",
        "مدى تأثيرها (منزل واحد / حي كامل، ولدينا خيارات إضافية)",
        "منذ متى بدأت المشكلة؟",
        "هل يوجد خطر مباشر على المارة؟",
        "وصف الشخص (الطفل، المفقود...)",
        "موقع آخر مشاهدة",
        "هل هو في خطر مباشر؟",
        "مدة الغياب أو فقدان الاتصال",
        "هل أظهر سلوكًا غريبًا أو خطرًا؟",
        "تفاصيل التواصل إن وُجدت"
    ],
    "FIRE": [
        "نوع المكان المحترق (منزل، سيارة، مستودع...)",
        "هل هناك أشخاص عالقون",
        "مدى انتشار الحريق",
        "وجود مواد قابلة للانفجار",
        "مصدر الانفجار أو التسرب",
        "هل يوجد مصابون",
        "هل تم إخلاء المكان",
        "مدى الضرر المادي الظاهر"
    ],
    "MEDICAL": [
        "عمر المريض التقريبي",
        "الوعي: واعي / فاقد وعي",
        "هل يتنفس المريض",
        "هل تلقى المريض أي إسعاف أولي",
        "مدة استمرار الحالة"
    ],
    "POLICE": [
        "عدد المصابين",
        "هل الطريق مغلق",
        "نوع المركبات",
        "عدد الأشخاص المشاركين",
        "نوع السلاح إن وُجد",
        "هل هناك مصابون",
        "وصف الشخص أو الأشخاص المتورطين"
    ],
    "TRAFFIC" : [
    "نوع الحادث (تصادم، انقلاب، انسداد... )",
    "عدد المركبات المتضررة",
    "هل هناك مصابون أو متوفون",
    "هل الطريق مغلق بالكامل أم جزئي",
    "موقع الحادث بدقة",
    "هل هناك خطر على المارة أو السائقين الآخرين",
    "مدة الانسداد المتوقعة أو الوقت منذ وقوع الحادث",
    "هل هناك حاجة لتدخل الإسعاف أو الإطفاء أو الشرطة",
    "تفاصيل إضافية عن الظروف المحيطة بالحادث"
    ]
}
